// 읍,면,리,동 구현 클래스


public class City {
	//---------------서울-----------------------------------------------------------
static String[] 강남 = { "전체", "개포동", "개포1동", "개포2동", "개포4동", "논현동", "논현1동", "논현2동", "대치동", "대치1동", "대치2동", "대치4동","도곡동", "도곡1동", "도곡2동", "삼성동", "삼성1동", "삼성2동", "세곡동", "수서동", "신사동", "압구정동", "역삼동", "역삼1동", "역삼2동", "율현동","일원동","일원1동","일원2동","일원본동","자곡동","청담동" };
static String[] 강동= {"전체","강일동","고덕동","고덕1동","고동2동","길동","둔촌동","둔촌1동","둔촌2동","명일동","명일1동","명일2동","상일동","성내동","성내1동","성내2동","성내3동","암사동","암사1동","암사2동","암사3동","천호동","천호1동","천호2동","천호3동"};
static String[] 강북= {"전체","미아동","번동","번1동","번2동","번3동","삼각산동","삼양동","송중동","송천동","수유동","수유1동","수유2동","수유3동","우이동","인수동"};
static String[] 강서= {"전체","가양동","가양1동","가양2동","가양3동","개화동","공항동","과해동","내발산동","등촌동","등촌1동","등촌2동","등촌3동","마곡동","방화동","방화1동","방화2동","방화3동","염창동","오곡동","오쇠동","외발산동","우장산동","화곡동","화곡1동","화곡2동","화곡3동","화곡4동","화곡6동","화곡8동","화곡본동"};
static String[] 관악= {"전체","낙성대동","난곡동","난향동","남현동","대학동","미성동","보라매동","봉천동","삼성동","서림동","서원동","성현동","신림동","신사동","신원동","은천동","인헌동","조원동","중앙동","청룡동","청림동","행운동"};
static String[] 광진= {"전체","광장동","구의동","구의1동","구의2동","구의3동","군자동","능동","자양동","자양1동","자양2동","자양3동","자양4동","중곡동","중곡1동","중곡2동","중곡3동","중곡4동","화양동"};
static String[] 구로= {"전체","가리봉동","개봉동","개봉1동","개봉2동","개봉3동","고척동","고척1동","고척2동","구로동","구로1동","구로2동","구로3동","구로4동","구로5동","궁동","신도림동","오류동","오류1동","오류2동","온수동","천왕동","항동"};
static String[] 금천= {"전체","가산동","독산동","독산1동","독산2동","독산3동","독산4동","시흥동","시흥1동","시흥2동","시흥3동","시흥4동","시흥5동"};
static String[] 노원= {"전체","공릉동","공릉1.3동","공릉2동","상계동","상계1동","상계2동","상계3.4동","상계5동","상계6.7동","상계8동","상계9동","상계10동","월계동","월계1동","월계2동","월계3동","중계동","중계1동","중계2.3동","중계4동","중계본동","하계동","하계1동","하계2동"};
static String[] 도봉= {"전체","도봉동","도봉1동","도봉2동","방학동","방학1동","방학2동","방학3동","쌍문동","쌍문1동","쌍문2동","쌍문3동","쌍문4동","창동","창1동","창2동","창3동","창4동","창5동"};
static String[] 동대문= {"전체","답십리동","답십리1동","답십리2동","신설동","용두동","이문동","이문1동","이문2동","장안동","장안1동","장안2동","전농동","전농1동","전농2동","제기동","청량리동","회기동","휘경동","휘경1동","휘경2동"};
static String[] 동작= {"전체","노량진동","노량진1동","노량진2동","대방동","동작동","본동","사당동","사당1동","사당2동","사당3동","사당4동","사당5동","상도동","상도1동","상도2동","상도3동","상도4동","신대방동","신대방1동","신대방2동","흑석동"};
static String[] 마포={"전체","공덕동","구수동","노고산동","당인동","대흥동","도화동","동교동","마포동","망원동","망원1동","망원2동","상수동","상암동","서교동","성산동","성산1동","성산2동","신공덕동","신수동","신정동","아현동","연남동","염리동","융강동","중동","창전동","토정동","하중동","합정동","현석동"};
static String[] 서대문= {"전체","남가좌동","남가좌1동","남가좌2동","냉천동","대신동","대현동","미근동","봉원동","북가자동","북가좌1동","북가좌2동","북아현동","신촌동","연희동","영천동","옥천동","창천동","천연동","충정로2가","충천로3가","충현동","합동","현저동","홍은동","홍은1동","홍은2동","홍제동","홍제1동","홍제2동","홍제3동"};
static String[] 서초= {"전체","내곡동","반포동","반포1동","반포2동","반포3동","반포4동","반포본동","방배동","방배1동","방배2동","방배3동","방배4동","방배본동","서초동","서초1동","서초2동","서초3동","서초4동","신원동","양재동","양재1동","양재2동","염곡동","우면동","원지동","잠원동"};
static String[] 성동= {"전체","금호동1가","금호동2가","금호동3가","금호동4가","도선동","마장동","사근동","상왕십리동","성수동1가","성수동2가","성수1가1동","성수1가2동","성수2가1동","성수2가3동","송정동","옥수동","용답동","응봉동","하왕십리동","행당동","행당1동","행당2동","홍익동"};
static String[] 성북= {"전체","길음동","길음1동","길음2동","돈암동","돈암1동","돈암2동","동선동1가","동선동2가","동선동3가","동선동4가","동선동5가","동소문동1가","동소문동2가","동소문동3가","동소문동4가","동소문동5가","동소문동6가","동소문동7가","보문동1가","보문동2가","보문동3가","보문동4가","보문동5가","보문동6가","보문동7가","삼선동1가","삼선동2가","삼선동3가","삼선동4가","삼선동5가","상월곡동","석관동","성북동","성북동1가","안암동1가","안암동2가","암암동3가","안암동4가","안암동5가","월곡1동","월곡2동","장위동","장위1동","장위2동","장위3동","정릉동","정릉1동","정릉2동","정릉3동","정릉4동","종암동","하월곡동"};
static String[] 송파= {"전체","가락동","가락1동","가락2동","가락본동","거여동","거여1동","거여2동","마천동","마천1동","마천2동","문정동","문정1동","문정2동","방이동","방이1동","방이2동","삼전동","석촌동","송파동","송파1동","송파2동","신천동","오금동","오륜동","위례동","잠실동","잠실2동","잠실3동","잠실4동","잠실6동","잠실7동","잠실본동","장지동","풍납동","풍납1동","풍납2동"};
static String[] 양천= {"전체","목동","목1동","목2동","목3동","목4동","목5동","신월동","신월1동","신월2동","신월3동","신월4동","신월5동","신월6동","신월7동","신정동","신정1동","신정2동","신정3동","신정4동","신정6동","신정7동"};
static String[] 영등포= {"전체","당산동","당산동1가","당산동2가","당산동3가","당산동4가","당산동5가","당산동6가","대림동","대림1동","대림2동","대림3동","도림동","문래동","문래동1가","문래동2가","문래동3가","문래동4가","문래동5가","문래동6가","신길동","신길1동","신길3동","신길4동","신길5동","신길6동","신길7동","양평동","양평동1가","양평동2가","양평동3가","양평동4가","양평동5가","양평동6가","양화동","여의도동","영등포동","영등포동1가","영등포동2가","영등포동3가","영등포동4가","영등포동5가","영등포동6가","영등포동7가","영등포동8가","영등포본동"};
static String[] 용산= {"전체","갈월동","남영동","도원동","동빙고동","동자동","문배동","보광동","산천동","서계동","서빙고동","신계동","신창동","용문동","용산동1가","원효로1가","원효로2가","원효로3가","원효로4가","이촌동","이촌1동","이촌2동","이태원동","이태원1동","이태원2동","주성동","청암동","청파동1가","청파동2가","청파동3가","한강로1가","한강로2가","한강로3가","한남동","효창동","후암동"};
static String[] 은평= {"전체","갈현동","갈현1동","갈현2동","구산동","녹변동","대조동","불광동","불광1동","불광2동","수색동","신사동","신사1동","신사2동","역촌동","응암동","응암1동","응암2동","응암3동","증산동","진관동"};
static String[] 종로= {"전체","가회동","견지동","경운동","계동","공평동","관수동","관철동","관훈동","교남동","교북동","구기동","궁정동","권농동","낙원동","내수동","내자동","누상동","누하동","당주동","도렴동","돈의동","동숭동","명륜1가","명륜2가","명륜3가","명륜4가","묘동","무악동","봉익동","부암동","사간동","사직동","삼청동","서린동","세종로","소격동","송월동","송현동","수송동","숭인동","숭인1동","숭인2동","신교동","신문로1가","신문로2가","신영동","안국동","연건동","연지동","예지동","옥인동","와룡동","운니동","원남동","원서동","이화동","익선동","인사동","인의동","장사동","재동","적선동","종로1가","종로2가","창성동","창신동","창신1동","창신2동","창신3동","청운동","청진동","체부동","충신동","통의동","통인동","팔판동","평동","평창동","필운동","행촌동","혜화동","홍지동","홍파동","화동","효자동","효제동","훈정동"};
static String[] 중구= {"전체","광희동1가","광희동2가","남대문로1가","남대문로2가","남대문로3가","남대문로4가","남대문로5가","남산동1가","남산동2가","남산동3가","남창동","남학동","다동","다산동","동화동","만리동1가","만리동2가","명동1가","명동2가","무교동","무학동","묵정동","방산동","봉래동1가","봉래동2가","북창동","산림동","삼각동","서소문동","소공동","수표동","수하동","순화동","신당동","신당1동","신당5동","쌍림동","약수동","예관동","예장동","오장동","을지로1가","을지로2가","을지로3가","을지로4가","을지로5가","을지로6가","을지로7가","의주로1가","의주로2가","인현동1가","인현동2가","입정동","장교동","장충동1가","장충동2가","저동1가","저동2가","정동","주교동","주자동","중림동","청구동","초동","충무로1가","충무로2가","충무로3가","충무로4가","충무로5가","충정로1가","태평로1가","태평로2가","필동1가","필동2가","필동3가","황학동","회현동1가","회현동2가","회현동3가","홍인동"};
static String[] 중랑= {"전체","망우동","망우3동","망우본동","면목동","면목2동","면목3.8동","면목4동","면목5동","면목7동","면목본동","묵동","묵1동","묵2동","상봉동","상봉1동","상봉2동","신내동","신내1동","신내2동","중화동","중화1동","중화2동"};


//--------------------경기----------------------------------------------------------
static String[] 가평시= {"전체","가평읍","북면","상면","설악면","조종면","청평면"};
static String[] 고양시덕양구= {"전체","강매동","고양동","관산동","내곡동","내유동","능곡동","대덕동","대자동","대장동","덕은동","도내동","동산동","벽제동","북한동","삼송동","선유동","성사동","성사1동","성사2동","신원동","신평동","오금동","용두동","원당동","원신동","원흥동","주교동","지축동","창릉동","토당동","행신동","행신1동","행신2동","행신3동","행주내동","행주동","행주외동","향동동","현천동","화전동","화정동","화정1동","화정2동","효자동","흥도동"};
static String[] 고양시일산동구= {"전체","고봉동","마두동","마두1동","마두2동","문봉동","백석동","백석1동","백석2동","사리현동","산황동","설문동","성석동","씩사동","장항동","장항1동","장항2동","정발산동","중산동","지영동","풍동","풍산동"};
static String[] 고양시일산서구= {"전체","가좌동","구산동","대화동","덕이동","법곳동","송산동","송포동","일산동","일산1동","일산2동","일산3동","주엽동","주엽1동","주엽2동","탄현동"};
static String[] 과전시= {"전체","갈현동","과천동","관문동","막계동","문원동","별양동","부림동","원문동","주암동","중앙동"};
static String[] 광명시= {"전체","가학동","광명동","광명1동","광명2동","광명3동","광명4동","광명5동","광명6동","광명7동","노온사동","소하동","소하1동","소하2동","옥길동","일직동","철산동","철산1동","철산2동","철산3동","철산4동","하안동","하안1동","하안2동","하안3동","하안4동"};
static String[] 광주시= {"전체","경안동","곤지암읍","남종면","남한산성면","도척면","목동","목현동","삼동","송정동","쌍령동","역동","오포읍","장지동","중대동","직동","초월읍","탄벌동","태전동","퇴촌면","회덕동"};
static String[] 구리시= {"전체","갈매동","교문동","교문1동","교문2동","동구동","사노동","수택동","수택1동","수택2동","수택3동","아천동","인창동","토평동"};
static String[] 군포시= {"전체","광정동","군포1동","군포2동","궁내동","금정동","당동","당정동","대야미동","도마교동","둔대동","부곡동","산본동","산본1동","산본2동","속달동","수리동","오금동","재궁동"};
static String[] 김포시= {"전체","감정동","걸포동","고촌읍","구래동","김포본동","대곶면","마산동","북변동","사우동","양촌읍","운양동","월곶면","장기동","장기본동","통진읍","풍무동","하성면"};
static String[] 남양주시= {"전체","가운동","금곡동","다산동","다산1동","다산2동","도농동","별내동","별내면","삼패동","수동면","수석동","양정동","오남읍","와부읍","이패동","일패동","조안면","지금동","진건읍","진접읍","퇴계원면","평내동","호평동","화도읍"};
static String[] 동두천시= {"전체","걸산동","광암동","동두천동","보산동","불현동","상봉암동","삼패동","생연1동","생연2동","생연동","소요동","송내동","안흥동","중앙동","지행동","탑동동","하봉암동"};
static String[] 부천시= {"전체","계수동","고강동","고강1동","고강본동","괴안동","내동","대장동","도당동","범박동","삼정동","상동","상1동","상2동","상3동","성곡동","소사동","소사본동","소사본3동","송내동","송내1동","송내2동","신흥동","심곡동","심곡1동","심곡2동","심곡3동","심곡본동","심곡본1동","약대동","여월동","역곡동","역곡1동","역곡2동","역곡3동","오정동","옥길동","원미동","원미1동","원미2동","원종동","원종1동","원종2동","작동","중동","중1동","중2동","중3동","중4동","춘의동"};
static String[] 성남시분당구= {"전체","구미동","구미1동","궁내동","금곡동","대장동","동원동","백현동","분당동","삼평동","서현동","서현1동","서현2동","석운동","수내동","수내1동","수내2동","수내3동","야탑동","야탑1동","야탑2동","야탑3동","운중동","율동","이매동","이매1동","이매2동","정자동","정자1동","정자2동","정자3동","판교동","하산운동"};
static String[] 성남시수정구= {"전체","고등동","금토동","단대동","둔전동","복정동","사송동","산성동","상적동","수진동","수진1동","수진2동","시흥동","신촌동","신흥동","신흥1동","신흥2동","신흥3동","심곡동","양지동","오야동","위례동","창곡동","태평동","태평1동","태평2동","태평3동","태평4동"};
static String[] 성남시중원구= {"전체","갈현동","금광동","긍광1동","금광2동","도촌동","상대원동","상대원1동","상대원2동","상대원3동","성남동","여수동","은행동","은행1동","은행2동","중앙동","하대원동"};
static String[] 수원시권선구= {"전체","고색동","곡반정동","구운동","권선동","금곡동","당수동","대황교동","서둔동","세류동","세류1동","세류2동","세류3동","오목천동","입북동","장지동","탑동","평동","평리동","호매실동"};
static String[] 수원시영통구= {"전체","광교동","망포동","매탄동","매탄1동","매탄2동","매탄3동","매탄4동","신동","영통동","영통1동","영통2동","원천동","이의동","태장동","하동"};
static String[] 수원시장안구= {"전체","상광교동","송죽동","연무동","영화동","율전동","이목동","정자동","정자1동","정자2동","정자3동","조원동","조원1동","조원2동","천천동","파장동","하광교동"};
static String[] 수원시팔달구= {"쩐체","고등동","교동","구천동","남수동","남창동","매교동","매산로1가","매산로2가","매산로3가","매향동","북수동","신풍동","영동","우만동","우만1동","우만2동","인계동","장안동","중동","지동","팔달로1가","팔달로2가","팔달로3가","화서동","화서1동","화서2동"};
static String[] 시흥시= {"전체","거모동","계수동","과림동","광석동","군자동","금이동","논곡동","능곡동","대야동","도창동","매화동","목감동","무지내동","물왕동","미산동","방산동","배곧동","산현동","신천동","신현동","안현동","연성동","월곶동","은행동","장곡동","장현동","정왕동","정왕1동","정왕2동","정왕3동","정왕4동","정왕본동","조남동","죽율동","포동","하상동","하중동","화정동"};
static String[] 안산시단원구= {"전체","고잔동","대부남동","대부동","대부동동","대부북동","목내동","백운동","선감동","선부동","선부1동","선부2동","선부3동","성곡동","신길동","와동","원곡동","원시동","중앙동","초지동","풍도동","호수동","화정동"};
static String[] 안산시상록구= {"전체","건건동","반월동","본오동","본오1동","본오2동","본오3동","부곡동","사동","사사동","사이동","성포동","수암동","안산동","양상동","월피동","이동","일동","장상동","장하동","팔곡이동","팔곡일동","해양동"};
static String[] 안성시= {"전체","가사동","가현동","계동","고삼면","공도읍","구포동","금광면","금산동","금석동","낙원동","당왕동","대덕면","대천동","도기동","봉남동","봉산동","사곡동","삼죽면","서운면","서인동","석정동","성남동","숭인동","신건지동","신모산동","신소현동","신흥동","아양동","안성1동","안성2동","안성3동","양성면","연지동","영동","옥산동","옥천동","원곡면","인지동","일죽면","죽산면","중리동","창전동","현수동"};
static String[] 안양시동안구= {"전체","갈산동","관양동","관양1동","관양2동","귀인동","달안동","범계동","부림동","부흥동","비산등","비산1동","비산2동","비산3동","신촌동","평안동","평촌동","호계동","호계1동","호계2동","호계3동"};
static String[] 안양시만안구= {"전체","박달동","박달1동","박달2동","석수동","석수1동","석수2동","석수3동","안양동","안양1동","안양2동","안양3동","안양4동","안양5동","안양6동","안양7동","안양8동","안양9동"};
static String[] 양주시 = {"전체","고암동","고읍동","광사동","광적면","남면","남방동","덕계동","덕정동","마전동","만송동","백석읍","봉양동","산북동","삼숭동","어둔동","옥정동","유양동","율정동","은현면","장흥면","회암동","회정동"};
static String[] 양평군= {"전체","강상면","강하면","개군면","단월면","서종면","양동면","양서면","양평읍","옥천면","용문면","지평면","청운면"};
static String[] 여주시= {"전체","가남읍","가업동","강천면","교동","금사면","능서면","능현동","단현동","대신면","매룡동","멱곡동","북내면","산북면","삼교동","상거동","상동","신진동","여흥동","연라동","연양동","오금동","오학동","우만동","월송동","점동면","점봉동","중앙동","창동","천송동","하거동","하동","현암동","홍문동","홍천면"};
static String[] 연천군= {"전체","군남면","미산면","백학면","신서면","연천읍","왕징면","장남면","전곡읍","중면","청산면"};
static String[] 오산시= {"전체","가수동","가장동","갈곶동","고현동","궐동","금암동","내삼미동","누읍동","두곡동","벌음동","부산동","서동","서랑동","세교동","수청동","양산동","오산동","외삼미동","원동","은계동","지곶동","청학동","청호동","탑동"};
static String[] 용인시기흥구= {"전체","고매동","공세동","구갈동","구성동","기흥동","농서동","동백동","마북동","보라동","보정동","상갈동","상하동","서농동","서천동","신갈동","언남동","영덕동","중동","지곡동","청덕동","하갈동"};
static String[] 용인시수지구= {"전체","고기동","동천동","상현1동","상현2동","상현동","성북동","신봉동","죽전동","죽전1동","죽전2동","풍덕천동","풍덕천1동","풍덕천2동"};
static String[] 용인시처인구= {"전체","고림동","김량장동","남동","남사면","동부동","마평동","모현읍","백암면","삼가동","양지면","역북동","역삼동","운학동","원삼면","유림동","유방동","이동읍","중앙동","포곡읍","해곡동","호동"};
static String[] 의왕시= {"전체","고천동","내손동","내손1동","내손2동","부곡동","삼동","오전동","왕곡동","월암동","이동","청계동","초평동","포일동","학의동"};
static String[] 의정부시= {"전체","가능동","가능1동","고산동","금오동","낙양동","녹양동","민락동","산곡동","송산1동","송산2동","신곡동","신곡1동","신곡2동","용현동","의정부동","의정부1동","의정부2동","의정부3동","자금동","자일동","장암동","호원동","호원1동","호원2동"};
static String[] 이천시 = {"전체","갈산동","고담동","관고동","단월동","대월면","대포동","마장면","모가면","백사면","부발읍","사음동","설성면","송정동","신둔면","안흥동","율면","율현동","장록동","장호원읍","중리동","증일동","증포동","진리동","창전동","호법면"};
static String[] 파주시= {"전체","검산동","광탄면","교하동","군내면","금능동","금촌동","금촌1동","금촌2동","다율동","당하동","동패동","맥금동","목동동","문발동","문산읍","법원읍","산남동","상지석동","서패동","송촌동","신촌동","아동동","야당동","야동동","연다산동","오도동","와도동","월롱면","장단면","적성면","조리읍","탄현면","파주읍","파평면","하지석동"};
static String[] 평택시= {"전체","가재동","고덕면","군문동","도일동","독곡동","동삭동","모곡동","비전동","비전1동","비전2동","서정동","서탄면","세교동","소사동","신대동","신장동","신자1동","신장2동","안중읍","오성면","용이동","월곡동","유천동","이충동","장당동","장안동","죽백동","지산동","지제동","진위면","청룡동","청북면","칠괴동","칠원동","통복동","팽성읍","평택동","포승읍","합정동","현덕면"};
static String[] 포천시= {"전체","가산면","관인면","군내면","내촌면","동교동","선단동","설운동","소흘읍","신북면","신읍동","어룡동","영북면","영중면","이동면","일동면","자작동","창수면","포천동","화현면"};
static String[] 하남시= {"전체","감북동","감이동","감일동","광암동","교산동","당정동","덕풍동","덕풍1동","덕풍2동","덕풍3동","망월동","미사동","미사1동","미사2동","배알미동","상사창동","상산곡동","선동","신장동","신장1동","신장2동","위례등","창우동","천현동","초이동","초일동","춘궁동","풍산동","하사창동","하산곡동","학암동","항동"};
static String[] 화성시= {"전체","금곡동","기배동","기산동","기안동","남양읍","능동","동탄1동","동탄2동","동탄3동","동탄4동","동탄5동","동탄6동","동탄7동","동탄8동","마도면","매송면","목동","반송동","반월동","반정동","방교동","배양동","병점동","병점1동","병점2동","봉담읍","비봉면","산척동","새솔동","서신면","석우동","송동","송산동","송산면","신동","안녕동","양감면","영천동","오산동","우정읍","장안면","장지동","정남면","중동","진안동","청계동","팔탄면","향남읍","화산동","황계동"};

//--------------------------인천-----------------------------------------------
static String[] 강화군= {"전체","강화읍","교동면","길상면","내가면","불은면","삼산면","서도면","선원면","송해면","양도면","양사면","하점면","하도면"};
static String[] 계양구= {"전체","갈현동","계산동","계산1동","계산2동","계산3동","계산4동","귤현동","노오지동","다남동","동양동","둑실동","목상동","박촌동","방축동","병방동","상야동","서운동","선주지동","오류동","용종동","이화동","임학동","작전동","작전1동","작전2동","작전3동","작전서운동","장기동","평동","하야동","효성동","효성1동","효성2동"};
static String[] 남동구= {"전체","간석동","간석1동","간석2동","간석3동","간석4동","고잔동","구월동","구월1동","구월2동","구월3동","구월4동","남촌동","논현동","도림동","만수동","만수1동","만수2동","만수3동","만수4동","만수5동","만수6동","서창동","수산동","운연동","장수동"};
static String[] 인천동구= {"전체","금곡동","만석동","송림동","송림1동","송림2동","송림3.5동","송림4동","송림6동","송현동","송현1.2동","송현3동","창영동","화수동","화수1동","화수2동","화평동"};
static String[] 미추홀구= {"전체","관교동","도화동","도화1동","도화2동","도화3동","문학동","숭의동","숭의1동","숭의2동","숭의3동","숭의4동","용현동","용현1동","용현2동","용현3동","용현4동","용현5동","주안동","주안1동","주안2동","주안3동","주안4동","주안5동","주안6동","주안7동","주안8동","학익동","학익1동","학익2동"};
static String[] 부평구= {"전체","갈산동","갈산1동","갈산2동","구산동","부개동","부개1동","부개2동","부개3동","부평동","부평1동","부평2동","부평3동","부평4동","부평5동","부평6동","산곡동","산곡1동","산곡2동","산곡3동","산곡4동","삼산동","삼산1동","삼산2동","십정동","십정1동","십정2동","일신동","청천동","청천1동","청천2동"};
static String[] 서구= {"전체","가정동","가정1동","가정2동","가정3동","가좌동","가좌1동","가좌2동","가좌3동","가좌4동","검암동","경서동","공촌동","금곡동","당하동","대곡동","마전동","백석동","불로동","석남동","석남1동","석남2동","석남3동","시천동","신현동","심곡동","연희동","오류동","왕길동","원당동","원창동","청라동","청라1동","청라2동","청라3동"};
static String[] 연수구= {"전체","동춘동","동춘1동","동춘2동","동춘3동","선학동","송도동","송도1동","송도2동","송도3동","송고4동","송도5동","연수동","연수1동","연수2동","연수3동","옥련동","옥련1동","옥련2동","청학동"};
static String[] 옹진군= {"전체","대청면","덕적면","백령면","북도면","연평면","영흥면","자월면"};
static String[] 인천중구= {"전체","경동","관동1가","관동2가","관동3가","남북동","내동","답동","덕교동","도원동","무의동","북성동1가","북성동2가","북성동3가","사동","선린동","선화동","송월동1가","송월동2가","송월동3가","송학동1가","송학동2가","송학동3가","신생동","신포동","신흥동1가","신흥동2가","신흥동3가","용동","운남동","운복동","운서동","유동","율목동","을왕동","인현동","전동","중산동","중앙동1가","중앙동2가","중앙동3가","중앙동4가","항동1가","항동2가","항동3가","항동4가","항동5가","항동6가","항동7가","해안동1가","해안동2가","해안동3가","해안동4가"};

//-------------------------------강원----------------------
static String[] 강릉시= {"전체","강동면","강문동","견소동","교동","교1동","교2동","구정면","금학동","난곡동","남문동","남항진동","내곡동","노암동","담산동","대전동","두산동","명주동","박월동","병산동","사천면","성남동","성내동","성산면","송정동","신석동","안현동","연곡면","옥계면","옥천동","왕산면","용강동","운산동","운정동","월호평동","유산동","유천동","임당동","입암동","장현동","저동","주문진읍","죽헌동","지변동","청량동","초당동","포남동","포남1동","포남2동","학동","홍제동","회산동"};
static String[] 고성군= {"전체","간성읍","거진읍","죽왕면","토성면","현내면"};
static String[] 동해시= {"전체","괴란동","구미동","구호동","귀운동","나안동","내동","단봉동","달방동","대구동","대진동","동호동","동회동","만우동","망상동","묵호진동","발한동","부곡동","북평동","비천동","삼화동","송정동","쇄운동","신흥동","심곡동","어달동","용정동","이기동","이도동","이로동","지가동","지흥동","천곡동","초구동","추암동","평릉동","호현동","효가동"};
static String[] 삼척시= {"전체","가곡면","갈천동","건지동","교동","근더겸ㄴ","근산동","남양동","노곡면","당저동","도경동","도계읍","등봉동","마달동","마평동","미로면","사직동","성남동","성내동","성북동","신기면","오분동","오사동","우지동","원당동","원덕읍","읍상동","읍중동","자원동","적노동","정상동","정하동","조비동","증산동","평전동","하장면"};
static String[] 속초시= {"전체","교동","금호동","노학동","대포동","도문동","동명동","설악동","영랑동","장사동","조양동","중앙동","청학동","청호동"};
static String[] 양구군= {"전체","남면","동면","방산면","양구읍","해안면"};
static String[] 양양군= {"전체","강현면","서면","손양면","양양읍","현남면","현북면"};
static String[] 영월군= {"전체","김삿갓면","남면","무릉도원면","북면","상동읍","영월읍","주천면","중동면","한반도면"};
static String[] 원주시= {"전체","가현동","개운동","관설동","귀래면","단계동","단구동","명륜동","명륜1동","명륜2동","무실동","문막읍","반곡동","붕산동","부론면","소초면","신림면","우산동","원동","인동","일산동","중앙동","지정면","태장동","태장1동","태장2동","판부면","평원동","학성동","행구동","호저면","흥업면"};
static String[] 인제군= {"전체","기린면","남면","북면","상남면","서화면","인제읍"};
static String[] 정선군= {"전체","고한읍","남면","북편면","사북읍","신동읍","여량면","임계면","정선읍","화암면"};
static String[] 철원군= {"전체","갈말읍","근남면","근북면","김화읍","동송읍","서면","철원읍"};
static String[] 춘천시= {"전체","교동","근화동","낙원동","남면","남산면","동내면","동면","동산면","봉의동","북산면","사농동","사북면","삼천동","서면","석사동","소양로1가","소양로2가","소양로3가","소양로4가","송암동","신동","신동면","신북읍","약사동","옥천동","온의동","요선동","우두동","운교동","조양동","죽림동","중도동","중앙로1가","중앙로2가","중앙로3가","칠전동","퇴계동","효자동","효자1동","효자2동","효자3동","후평동","후평1동","후평2동","후평3동"};
static String[] 태백시= {"전체","구문소동","금천동","동점동","문곡동","백산동","삼수동","상사미동","상장동","소도동","원동","장성동","적각동","조탄동","창죽동","철암동","통동","하사미동","혈동","화전동","황연동","황지동"};
static String[] 평창군= {"전체","대관령면","대화면","미탄면","방림면","봉평면","용평면","진부면","평창읍"};
static String[] 홍천군= {"전체","남면","내면","내촌면","동면","두촌면","북방면","서면","서석면","홍천읍","화촌면"};
static String[] 화천군= {"전체","간동면","사내면","상서면","하남면","화천읍"};
static String[] 횡성군= {"전체","갑천면","강림면","공근면","둔내면","서원면","안흥면","우천면","청일면","횡성읍"};

//--------------------------대전--------------------------
static String[] 대덕구= {"전체","갈전동","대화동","덕암동","목상동","문평동","미호동","법동","법1동","법2동","부수동","비래동","삼정동","상서동","석봉동","송촌동","신대동","신일동","신탄진동","연축동","오정동","와동","용호동","읍내동","이현동","장동","중리동","평촌동","황호동"};
static String[] 대전동구= {"전체","가양동","가양1동","가양2동","가오동","구도동","낭월동","내탑동","대동","대별동","대성동","마산동","비룡동","사성동","삼괴동","삼성동","삼정동","상소동","성남동","세천동","소제동","소호동","신상동","신안동","신촌동","신하동","신흥동","오동","용계동","용운동","용전동","원동","이사동","인동","자양동","장척동","정동","주산동","주촌동","중동","직동","천동","추동","판암동","판암1동","판암2동","하소동","홍도동","효동","효평둉"};
static String[] 대전서구= {"전첸","가수원동","가장동","갈마동","갈마1동","갈마2동","관저동","관저1동","관저2동","괴곡동","괴정동","내동","도마동","도마1동","도마2동","도안동","둔산동","둔산1동","둔산2동","둔산3동","만년동","매노동","변동","복수동","봉곡동","산직동","오동","용문동","용촌동","우명동","원정동","월평1동","월평2동","월평3동","월평동","장안동","정림동","탄방동","평촌동","흑석동"};
static String[] 유성구= {"전체","가정동","갑동","계산동","관평동","교촌동","구룡동","구성동ㅇ","구암동","궁동","금고동","금탄동","노은동","대동","대정동","덕명동","덕진동","도룡동","둔곡동","문지동","반석동","방동","방현동","복용동","봉명동","봉산동","상대동","성북동","세동","송강동","송정동","수남동","신동","신봉동","신성동","안산동","어은동","외삼동","용계동","용산동","원내동","원신흥동","원촌동","자운동","장대동","장동","전민동","죽동","지족동","추목동","탑립동","하기동","학하동","화암동"};
static String[] 대전중구= {"전체","구완동","금동","대사동","대흥동","목달동","목동","무수동","문창동","문화동","문화1동","문화2동","부사동","사정동","산성동","석교동","선화동","안영동","어남동","오류동","옥계동","용두동","유천동","유천1동","유천2동","은행동","정생동","중촌동","침산동","태평동","태평1동","태평2동","호동"};

}

